In [12]:
import pandas as pd

# SERIES

In [13]:
import numpy as np
data = np.array([101,102,103,104])
s = pd.Series(data)
print(data) 
print()
print(s)
print()

print(s[1]) #accessing the value of index no 1
s[1]=100 #replacing the value of index no 1
s[4]=200 #adding new value
print(s)

[101 102 103 104]

0    101
1    102
2    103
3    104
dtype: int32

102
0    101
1    100
2    103
3    104
4    200
dtype: int64

In [14]:
s = pd.Series(data, index = ["a","b","c","d"]) #assigning row labels to index no's, by keeping both index no and row labels
print(s)
print(s["b"]) #accessing through row label
print(s[1]) #accessing through index no

a    101
b    100
c    103
d    104
dtype: int32
100
100

In [15]:
list1=np.arange(1001,1005,1) #1 is used for incrementing the value by 1
s=pd.Series(data,index=list1)
print(s)
print(s[1002])
#print(s[1]) #it will through error as index no's are replaced

1001    101
1002    100
1003    103
1004    104
dtype: int32
100

In [16]:
data = {'a':0, 'b':1, 'c':2}
s = pd.Series(data)
print(s)

print(s['a'])
print()
print(s[-2:]) #-2 is the second last data

a    0
b    1
c    2
dtype: int64
0

b    1
c    2
dtype: int64

# DATA FRAMES

In [17]:
#indexed data frame from data list
data = [['Amit',40],['Nikita',23],['Clara',33]]
df = pd.DataFrame(data,columns=['Name','Age']) #assigning column names while creating data frame
print(df)

#assigning column names after creating the data frame
#df.columns=["Name","Age"]
#print(df)

     Name  Age
0    Amit   40
1  Nikita   23
2   Clara   33

In [18]:
#indexed data frame from dict
data={'Name':['Amit','Nikita','Clara'],'Age':[10,20,30]}
df=pd.DataFrame(data)
print(df)
df=pd.DataFrame(data, index=['E1','E2','E3'])
print(df)

     Name  Age
0    Amit   10
1  Nikita   20
2   Clara   30
      Name  Age
E1    Amit   10
E2  Nikita   20
E3   Clara   30

In [19]:
#accessing the data frames
df["Name"]

E1      Amit
E2    Nikita
E3     Clara
Name: Name, dtype: object

In [20]:
df[["Name","Age"]]

      Name  Age
E1    Amit   10
E2  Nikita   20
E3   Clara   30

In [21]:
#adding a column
df['address']=["Mumbai","Pune","Mumbai"]
df

      Name  Age address
E1    Amit   10  Mumbai
E2  Nikita   20    Pune
E3   Clara   30  Mumbai

In [22]:
#realining the variable/column names
df=df[["Name","address","Age"]]
df

      Name address  Age
E1    Amit  Mumbai   10
E2  Nikita    Pune   20
E3   Clara  Mumbai   30

In [23]:
#adding two new columns
df["Newcol"]=[5,10,12]
print(df)

#column added through calculation
df["Revised_col"]=df["Newcol"]*2
print(df)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

      Name address  Age  Newcol
E1    Amit  Mumbai   10       5
E2  Nikita    Pune   20      10
E3   Clara  Mumbai   30      12
      Name address  Age  Newcol  Revised_col
E1    Amit  Mumbai   10       5           10
E2  Nikita    Pune   20      10           20
E3   Clara  Mumbai   30      12           24

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

In [24]:
#deleting a column
del df["Newcol"]
print(df)

      Name address  Age  Revised_col
E1    Amit  Mumbai   10           10
E2  Nikita    Pune   20           20
E3   Clara  Mumbai   30           24

In [25]:
#droping row and column
df=df.drop('E1')
df=df.drop('Revised_col', axis=1) #axis = 1 means column (and 0 means rows)
print(df)

      Name address  Age
E2  Nikita    Pune   20
E3   Clara  Mumbai   30

In [38]:
#accessing data elements using indexes and labels
#loc is used for row labels i.e Selecting data by label or by a conditional statment (.loc)

#iloc is used for index no's i.e Selecting data by row numbers (.iloc)

#df.loc[inclusive:inclusive]
print(df.loc['E2'])
print()
print(df.loc["E2":"E3"])
print()

Name       Nikita
address      Pune
Age            20
Name: E2, dtype: object

      Name address  Age
E2  Nikita    Pune   20
E3   Clara  Mumbai   30

In [48]:
#df.iloc[inclusive:exclusive]
print(df.iloc[0:2]) #selecting first two rows
print()
print(df.loc["E2":"E3",["address","Age"]])
print()
print(df.iloc[:,[1,2]]) #all rows with

      Name address  Age
E2  Nikita    Pune   20
E3   Clara  Mumbai   30

   address  Age
E2    Pune   20
E3  Mumbai   30

   address  Age
E2    Pune   20
E3  Mumbai   30

In [37]:
#saving dataframe to a file
df.to_csv(r'C:\Users\Manoj Nahak\Desktop\sampledf.csv', index = True, header=True) #.txt as well

df.to_excel(r'C:\Users\Manoj Nahak\Desktop\sampledf.xlsx', index=False, header=True)
print('Done')

Done

In [40]:
#reading df from a CSV file
df2 = pd.read_csv(r'C:\Users\Manoj Nahak\Desktop\sampledf.csv', index_col=0, header=0)
print(df2)

      Name address  Age
E2  Nikita    Pune   20
E3   Clara  Mumbai   30

In [41]:
#reading df from a xlsx file
df3=pd.read_excel(r'C:\Users\Manoj Nahak\Desktop\sampledf.xlsx')
print(df3)

     Name address  Age
0  Nikita    Pune   20
1   Clara  Mumbai   30

In [45]:
#4 common data types, Int, Float for numerical
# and for character, string it will be object
#preparing the data
#print(df.dtypes)
#print(df.Age.dtype)
#print(df.shape)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, E2 to E3
Data columns (total 3 columns):
Name       2 non-null object
address    2 non-null object
Age        2 non-null int64
dtypes: int64(1), object(2)
memory usage: 144.0+ bytes

In [46]:
#updating the data
df.set_value('E2',['Name','Age'],["Rajesh",40]) #replacing data
df.set_value('E1',['Name','Age'],["Ramesh",29]) #adding a new row

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: set_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: set_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead
  This is separate from the ipykernel package so we can avoid doing imports until

      Name address   Age
E2  Rajesh    Pune  40.0
E3   Clara  Mumbai  30.0
E1  Ramesh     NaN  29.0

In [49]:
#updating the values through condition
df.loc[(df.Name == "Rajesh")&(df.address == "Pune"), ["address", "Name"]] = ["Lucknow","Amitabh"]
df

       Name  address   Age
E2  Amitabh  Lucknow  40.0
E3    Clara   Mumbai  30.0
E1   Ramesh      NaN  29.0

In [53]:
df.loc[(df.Name=="Ramesh"),["address"]]="Mumbai"

In [54]:
df.sort_values(['address','Name'],ascending=False) #sorting in descending

       Name  address   Age
E1   Ramesh   Mumbai  29.0
E3    Clara   Mumbai  30.0
E2  Amitabh  Lucknow  40.0

In [57]:
#sorting through index no (used in time series)
df.sort_index(axis=0, ascending=True)

       Name  address   Age
E1   Ramesh   Mumbai  29.0
E2  Amitabh  Lucknow  40.0
E3    Clara   Mumbai  30.0